## Staging: network

**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  


```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
aws_eip.lambda: Refreshing state... [id=eipalloc-06155a058c941b5dd]
aws_vpc.main: Refreshing state... [id=vpc-0d895a01b47ccfb04]
aws_default_route_table.default: Refreshing state... [id=rtb-0228b7d35bdfba348]
aws_security_group.efs: Refreshing state... [id=sg-0e73d581666d1f412]
aws_default_network_acl.default: Refreshing state... [id=acl-0a293e49ea86cc7ce]
aws_internet_gateway.gw: Refreshing state... [id=igw-08031402dc515616c]
aws_subnet.private: Refreshing state... [id=subnet-07f256fc1e9b65732]
aws_security_group.lambda: Refreshing state... [id=sg-090d16d17a0b6c2b1]
aws_default_security_group.default: Refreshing state... [id=sg-07bbdcb4fc6d20a75]
aws_subnet.public: Refreshing state... [id=subnet-066a4cc52f615255c]
aws_route_table.public: Refreshing state... [id=rtb-0c40a8fd1f51baec7]
aws_security_group_rule.efs_egress: Refreshing state... [id=sgrule-235191165]
aws_security_group_rule.efs_ingress: Refreshing state... [id=sgrule-2369537510]
aws_security_group_rule.inet_egress: Refreshing state... [id=sgrule-1598225514]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-09d9428ba0886977f]
aws_network_acl.main: Refreshing state... [id=acl-0af86631764523f8a]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-09e7050aa7d123674]
aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-03329e92062edf232]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05cc02536d86ce34d]
aws_route_table.private: Refreshing state... [id=rtb-08c76912dc727184b]
aws_route_table_association.a: Refreshing state... [id=rtbassoc-0043ca13d1dec5810]
aws_security_group_rule.dynamodb_privatelink: Refreshing state... [id=sgrule-2068073685]
aws_security_group_rule.s3_private_link: Refreshing state... [id=sgrule-2802359572]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.vpc_metrics_flow_logs_write will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_metrics_flow_logs_write"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_log_group.vpc_metrics_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_metrics_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "vpc_metrics_flow_logs"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # aws_flow_log.vpc_metrics_flow_logs will be created
  + resource "aws_flow_log" "vpc_metrics_flow_logs" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = (known after apply)
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-0d895a01b47ccfb04"
    }

  # aws_iam_policy.vpc_metrics_flow_logs_write will be created
  + resource "aws_iam_policy" "vpc_metrics_flow_logs_write" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertMetricsVpcFlowLogs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.vpc_metrics_flow_logs will be created
  + resource "aws_iam_role" "vpc_metrics_flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vpc_metrics_flow_logs"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write will be created
  + resource "aws_iam_role_policy_attachment" "vpc_metrics_flow_logs_write" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "vpc_metrics_flow_logs"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"
```
</details>